# Напишете програма, която изчислява какви разходи ще има Джеси,
# ако започне да тренира, като знаете колко е таксата за
# тренировки по баскетбол за период от 1 година. Нужна екипировка:
#	Баскетболни кецове – цената им е 40% по-малка от таксата за една година
#	Баскетболен екип – цената му е 20% по-евтина от тази на кецовете
#	Баскетболна топка – цената ѝ е 1 / 4 от цената на баскетболния екип
#	Баскетболни аксесоари – цената им е 1 / 5 от цената на баскетболната топка

# От конзолата се четe 1 ред:
#	Годишната такса за тренировки по баскетбол – цяло число в интервала [0… 9999]

# Да се отпечата на конзолата колко ще са разходите на Джеси, ако започне да спортува баскетбол.

annual_tax = int(input())
shoes_price = annual_tax - (annual_tax * 0.40)
outfit_price = shoes_price - (shoes_price * 0.20)
ball_price = outfit_price / 4
accessories_price = ball_price / 5
equipment_price = shoes_price + outfit_price + ball_price + accessories_price

total_sum = annual_tax + equipment_price
print(total_sum)
